# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\acer\Desktop\Saura-master\2_Psoc\Platform\Design02.cydsn\Design02.cyprj
# Date: Tue, 18 Oct 2016 17:53:33 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {emFile_1_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {CLK_Co_Op_Timer_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_clock -name {CLK_Co_Op_Timer_Clock(fixed-function)} -period 10000 -waveform {0 41.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_4}]
create_generated_clock -name {CLK_pre_emp_timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_clock -name {CLK_pre_emp_timer_clock(fixed-function)} -period 10000 -waveform {0 41.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_3}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\acer\Desktop\Saura-master\2_Psoc\Platform\Design02.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\acer\Desktop\Saura-master\2_Psoc\Platform\Design02.cydsn\Design02.cyprj
# Date: Tue, 18 Oct 2016 17:53:12 GMT
